In [5]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20,10)

In [6]:
df1=pd.read_csv("chennai_property_price.csv")
df1.head()

,price,area,status,bhk,bathroom,age,location,builder
0,37.49,872,Ready to move,2,NaN,1.0,Sembakkam,MP Developers
1,93.54,1346,Under Construction,3,2.0,NaN,Selaiyur,DAC Promoters
2,151.00,2225,Under Construction,3,NaN,0.0,Mogappair,Casagrand Builder Private Limited
3,49.00,1028,Ready to move,2,2.0,3.0,Ambattur,Dugar Housing Builders
4,42.28,588,Under Construction,2,1.0,0.0,Pallavaram,Radiance Realty Developers India Ltd

In [7]:
df1.shape()

TypeError: 'tuple' object is not callable

In [9]:
df1.groupby('location')['location'].agg('count')

location
Adambakam         8
Adyar            11
Agaramthen        7
Alandur           5
Alwarpet         11
                 ..
Virugambakkam     8
Washermanpet      1
West Mambalam    47
West Tambaram     7
tambaram west    14
Name: location, Length: 178, dtype: int64

In [13]:
df2=df1.drop([status','builder','age'],axis='columns')
df2.head()

    price  area  bhk    location
0   37.49   872    2   Sembakkam
1   93.54  1346    3    Selaiyur
2  151.00  2225    3   Mogappair
3   49.00  1028    2    Ambattur
4   42.28   588    2  Pallavaram